[
  {
    "Number": 1,
    "Title": "Ex Machina",
    "Comments": "There were so many plot twists that I was on edge all throughout the movie (in a good way of course). Oscar Issac’s acting was amazing as well.",
    "Watched": 2022
  },
  {
    "Number": 2,
    "Title": "Burning",
    "Comments": "I encountered Burning after my freshman year of college when I was feeling unsure of my future. Probably why it stood out so much for me and is one of my favorites till today.",
    "Watched": 2019
  },
  {
    "Number": 3,
    "Title": "Chungking Express",
    "Comments": "Love the overall mood of the movie. In an alternate universe, I would be a heartbroken romantic crying over expired pineapples or perhaps a police officer in Hong Kong.",
    "Watched": 2014
  },
  {
    "Number": 4,
    "Title": "Baby Driver",
    "Comments": "Loved the soundtrack, the speed, and comedy of the whole movie. Never a boring shot.",
    "Watched": 2017
  },
  {
    "Number": 5,
    "Title": "Source Code",
    "Comments": "I remember watching Source Code for the first time at the theatre. I didn't think much of it at first but Source Code is a movie that grew on me the more I watched it.",
    "Watched": 2015
  },
  {
    "Number": 6,
    "Title": "Punch Drunk Love",
    "Comments": "Punch Drunk Love was one of my highschool favorites. Very different from all the other PTA movies imo but I enjoyed how absurd the whole movie was.",
    "Watched": 2016
  },
  {
    "Number": 7,
    "Title": "The Prestige",
    "Comments": "I find myself admiring how intricate and well thought out Nolan's movies are. The Prestige was especially striking because I never expected the ending.",
    "Watched": 2017
  },
  {
    "Number": 8,
    "Title": "Clockwork Orange",
    "Comments": "Theres something about teenage rebellion and ultraviolence that makes for an exciting story.",
    "Watched": 2015
  },
  {
    "Number": 9,
    "Title": "There will be Blood",
    "Comments": "Definitely my favorite PTA movie. Oil, family, money, blood. Theres almost too much symbolism in this movie that I feel like I'll never fully figure out everything PTA was thinking.",
    "Watched": 2017
  },
  {
    "Number": 10,
    "Title": "The Batman",
    "Comments": "A recent favorite. Love the cinematography. The grimy city captured in its full. Reminds me a lot of New York.",
    "Watched": 2022
  },
  {
    "Number": 11,
    "Title": "Howl's Moving Castle",
    "Comments": "Beautiful animation and very dreamy. Howl's Moving Castle is a favorite for me because it excels in what its trying to do and doesn't shy away from it at all.",
    "Watched": 2013
  },
  {
    "Number": 12,
    "Title": "The Wind Rises",
    "Comments": "Loved the passion Jiro had for his work and the struggle to find a balance between life and work. As a creative, I thought there was a lot to admire about Jiro.",
    "Watched": 2020
  },
  {
    "Number": 13,
    "Title": "Akira",
    "Comments": "I almost bought in to the hype around Akira because it has such a big cult following. Aside from all that, the handdrawn animation is beautiful and the Akira universe is very much believable.",
    "Watched": 2018
  },
  {
    "Number": 14,
    "Title": "Perfect Blue",
    "Comments": "I'm still amazed this film was released in 1997.",
    "Watched": 2016
  },
  {
    "Number": 15,
    "Title": "The Handmaiden",
    "Comments": "In the search for more Korean movies, I encountered The Handmaiden. I'm in love with the atmosphere of the movie and the amount of investment I had with characters in the film.",
    "Watched": 2020
  },
  {
    "Number": 16,
    "Title": "Oldboy",
    "Comments": "The action scenes are iconic for a reason and every second of the movie was a treat to watch.",
    "Watched": 2016
  },
  {
    "Number": 17,
    "Title": "Parasite",
    "Comments": "I ended up watching Parasite a couple times just because it was so big back when it won the Oscar. Even when watching it multiple times, I was able to find something new about the film each time around.",
    "Watched": 2019
  },
  {
    "Number": 18,
    "Title": "Her",
    "Comments": "Watching Her the first time around was pretty offputting. The topic was super interesting though and the almost dystopic vibe of the movie was interesting.",
    "Watched": 2019
  },
  {
    "Number": 19,
    "Title": "Moonlight",
    "Comments": "Moonlight is in this list primarily for its soundtrack. I love how a single melody develops & matures along with the main character. Just very poetic.",
    "Watched": 2016
  },
  {
    "Number": 20,
    "Title": "Gravity",
    "Comments": "I remember the local movie theatre back when Gravity first premiered was screening it on a special big screen. The movie was great but going to the theatre with my dad and getting popcorn & all the ordeals was what makes Gravity special for me.",
    "Watched": 2013
  },
  {
    "Number": 21,
    "Title": "Soul",
    "Comments": "I liked how the emphasis of Soul was on mundane life and appreciating it.",
    "Watched": 2020
  },
  {
    "Number": 22,
    "Title": "Ratatoullie",
    "Comments": "Ratatoullie was one of my earlier encounters with animation and is still one of my favorites of all time. The characters are so simple yet they work for me.",
    "Watched": 2013
  },
  {
    "Number": 23,
    "Title": "Boyhood",
    "Comments": "Boyhood felt very raw and genuine which I really appreciated.",
    "Watched": 2014
  },
  {
    "Number": 24,
    "Title": "Fight Club",
    "Comments": "Rule 1 of Fight Club.",
    "Watched": 2016
  },
  {
    "Number": 25,
    "Title": "The Lobster",
    "Comments": "The idea of dating as a life or death situation and turning people into animals sounds absurd but the way The Lobster conveys its story was nice.",
    "Watched": 2018
  },
  {
    "Number": 26,
    "Title": "The Social Network",
    "Comments": "A part of me wants to be a tech bro and The Social Network allowed me to live that life vicariously.",
    "Watched": 2018
  },
  {
    "Number": 27,
    "Title": "New World",
    "Comments": "I would never be able to join a gang nevertheless threaten anyone but seeing actors play the role out in style was exciting.",
    "Watched": 2017
  },
  {
    "Number": 28,
    "Title": "Moonrise Kingdom",
    "Comments": "I had a teacher in highschool who was really into coming of age films and he introduced me to Moonrise Kingdom. The colors are nice, too.",
    "Watched": 2016
  },
  {
    "Number": 29,
    "Title": "Trainspotting",
    "Comments": "Another teenage rebellion movie. Nothing new but enjoyed it.",
    "Watched": 2016
  },
  {
    "Number": 30,
    "Title": "Memories of Murder",
    "Comments": "Murder mystery with an unresolved ending. I enjoyed how the main character progresses throughout the movie and seeing how low he could stoop for the sake of justice.",
    "Watched": 2015
  }
]